import React from 'react';

class Home extends React.Component
{
    render()
    {
        return(
            <div>
                <blockquote className="home">
                    Я вірю, що інженери врятують світ.
                    <p className="autor"><i>Джей Лено, американський телеведучий і письменник.</i></p>
                </blockquote>
                <blockquote className="home">
                    Давайте розглянемо приклад технології автомобіля без водія. Ідея з’явилася ще в 1990-х. 
                    Перший прототип був представлений в 2004 році, десять років тому. 
                    Але тільки зараз, через 20 років від появи ідеї, технологія починає виходити на ринок, 
                    і більшість з нас все ще не має подібного авто. 
                    Іншими словами, процес появи нових технологій займає набагато більше часу, ніж багато хто думає.
                    <p className="autor"><i>Ерік Шмідт, голова ради директорів компанії Google.</i></p>
                </blockquote>
                <blockquote className="home">
                    Для мене головне – це роль технології, її зв’язок з людським капіталом та людським потенціалом. 
                    Технології дають можливість робити великі речі. 
                    Ви повинні бути оптимістично налаштовані щодо того, що технологія може зробити в руках людини.
                    <p className="autor"><i>Сатья Надела, головний виконавчий директор корпорації Microsoft.</i></p>
                </blockquote>
                <blockquote className="home">
                    Ніколи не довіряй комп’ютеру, який ти не можеш викинути у вікно
                    <p className="autor"><i>Стів Возняк, співзасновник компанії Apple.</i></p>
                </blockquote>
            </div>
        )
    }
}
export default Home;