import React from 'react';
import NewsList from './NewsList';

class NewsContainer extends React.Component
{
    state = {
        news: [
            {
                id:1,
                title: "EPAM запрошує на другу хвилю магістерської програми «Інженерія програмного забезпечення»",
                article: "Минулого року світовий постачальник ІТ-послуг ЕРАМ та його партнер Національний університет «Києво-Могилянська академія» запустили спільну магістерську програму «Інженерія програмного забезпечення»." 
                + "Мета такої співпраці – якісно нова підготовка досвідчених ІТ-спеціалістів із фокусом на прикладні знання та потреби бізнесу. Наразі відкрито набір на другу хвилю навчання."
            },
            {
                id:2,
                title:"Чеські програмісти за два дні зробили безкоштовний сайт, на який уряд виділив 16 млн євро",
                article: "У Чехії група програмістів безкоштовно за одні вихідні зробила сайт, на розробку якого уряд планував витратити майже 16 млн євро." 
                + "Після цього звільнили міністра транспорту Чехії Володимира Кремлика, повідомляє чеське видання Novinky.cz."
                + "Як повідомляється, розробники зробили сайт державного сервісу на знак протесту проти «марнотратства» міністерства транспорту."
                + "На думку фахівців, держава уклала завищений контракт."
            },
            {
                id:3,
                title: "Освіта майбутнього: у Львові відкривають першу ІТ-школу",
                article: "ІТ-школа – це новий проект IT Step Academy, яка відома далеко за межами України." 
                + "Дотепер діти відвідували комп’ютерну академію у рамках позашкільної освіти." 
                + "Та, зважаючи на попит, цього року в IT Step з’явився новий проект – у вигляді загальноосвітньої школи."
                + "Школярі вивчатимуть всі предмети, передбачені Міністерством освіти як обов’язкові, а також спеціалізовані ІТ-дисципліни."
                + "Школа вже отримала відповідну ліцензію."

            }
        ]
    }
    render()
    {
        return(
            <NewsList News = {this.state.news} />
        )
    }
}
export default NewsContainer;